In [1]:
%load_ext sql

In [2]:
import csv, sqlite3

con = sqlite3.connect("my_data1.db")
cur = con.cursor()

In [3]:
%sql sqlite:///my_data1.db

'Connected: @my_data1.db'

In [4]:
import pandas as pd
df = pd.read_csv("https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBM-DS0321EN-SkillsNetwork/labs/module_2/data/Spacex.csv")
df.to_sql("SPACEXTBL", con, if_exists='replace', index=False,method="multi")

999

In [5]:
%sql select distinct(launch_site) from spacextbl;

 * sqlite:///my_data1.db
Done.

[('CCAFS LC-40',),
 ('VAFB SLC-4E',),
 ('KSC LC-39A',),
 ('CCAFS SLC-40',),
 (None,)]

In [6]:
%sql select * from spacextbl where launch_site like "CCA%" limit 5;

 * sqlite:///my_data1.db
Done.

[('06/04/2010', '18:45:00', 'F9 v1.0  B0003', 'CCAFS LC-40', 'Dragon Spacecraft Qualification Unit', 0.0, 'LEO', 'SpaceX', 'Success', 'Failure (parachute)'),
 ('12/08/2010', '15:43:00', 'F9 v1.0  B0004', 'CCAFS LC-40', 'Dragon demo flight C1, two CubeSats, barrel of Brouere cheese', 0.0, 'LEO (ISS)', 'NASA (COTS) NRO', 'Success', 'Failure (parachute)'),
 ('22/05/2012', '7:44:00', 'F9 v1.0  B0005', 'CCAFS LC-40', 'Dragon demo flight C2', 525.0, 'LEO (ISS)', 'NASA (COTS)', 'Success', 'No attempt'),
 ('10/08/2012', '0:35:00', 'F9 v1.0  B0006', 'CCAFS LC-40', 'SpaceX CRS-1', 500.0, 'LEO (ISS)', 'NASA (CRS)', 'Success', 'No attempt'),
 ('03/01/2013', '15:10:00', 'F9 v1.0  B0007', 'CCAFS LC-40', 'SpaceX CRS-2', 677.0, 'LEO (ISS)', 'NASA (CRS)', 'Success', 'No attempt')]

In [7]:
%sql select sum(payload_mass__kg_) as "Total Payload Mass (NASA CRS)" from spacextbl where customer="NASA (CRS)";

 * sqlite:///my_data1.db
Done.

[(45596.0,)]

In [8]:
%sql select avg(payload_mass__kg_) as "Avergae Payload Mass (F9 v1.1)" from spacextbl where booster_version = "F9 v1.1"

 * sqlite:///my_data1.db
Done.

[(2928.4,)]

In [9]:
%sql select min(date) as "First Success(Ground Pad)" from spacextbl where landing_outcome = "Success (ground pad)";

 * sqlite:///my_data1.db
Done.

[('01/08/2018',)]

In [10]:
%sql select distinct booster_version from spacextbl where landing_outcome = "Success (drone ship)" and payload_mass__kg_ \
between 4000 and 6000;

 * sqlite:///my_data1.db
Done.

[('F9 FT B1022',), ('F9 FT B1026',), ('F9 FT  B1021.2',), ('F9 FT  B1031.2',)]

In [19]:
%sql select mission_outcome, count(mission_outcome) as Number from spacextbl group by mission_outcome;

 * sqlite:///my_data1.db
Done.

[(None, 0),
 ('Failure (in flight)', 1),
 ('Success', 98),
 ('Success ', 1),
 ('Success (payload status unclear)', 1)]

In [18]:
%sql select booster_version from spacextbl where payload_mass__kg_ = (select max(payload_mass__kg_) from spacextbl);

 * sqlite:///my_data1.db
Done.

[('F9 B5 B1048.4',),
 ('F9 B5 B1049.4',),
 ('F9 B5 B1051.3',),
 ('F9 B5 B1056.4',),
 ('F9 B5 B1048.5',),
 ('F9 B5 B1051.4',),
 ('F9 B5 B1049.5',),
 ('F9 B5 B1060.2 ',),
 ('F9 B5 B1058.3 ',),
 ('F9 B5 B1051.6',),
 ('F9 B5 B1060.3',),
 ('F9 B5 B1049.7 ',)]

In [20]:
%sql select booster_version, launch_site from spacextbl where landing_outcome = "Failure (drone ship)" and date like "%2015";

 * sqlite:///my_data1.db
Done.

[('F9 v1.1 B1012', 'CCAFS LC-40'), ('F9 v1.1 B1015', 'CCAFS LC-40')]

In [21]:
%sql SELECT landing_outcome, COUNT(*) AS QTY FROM SPACEXTBL where date > "2010-06-04" GROUP BY landing_outcome \
ORDER BY QTY DESC;

 * sqlite:///my_data1.db
Done.

[('Success', 13),
 ('No attempt', 7),
 ('Success (drone ship)', 6),
 ('Uncontrolled (ocean)', 2),
 ('Controlled (ocean)', 2),
 ('Success (ground pad)', 1),
 ('Precluded (drone ship)', 1)]

In [23]:
%sql SELECT landing_outcome, COUNT(landing_outcome) AS qty FROM spacextbl WHERE date BETWEEN '01-06-2010' AND '20-03-2017' \
GROUP BY landing_outcome;

 * sqlite:///my_data1.db
Done.

[('Controlled (ocean)', 3),
 ('Failure', 3),
 ('Failure (drone ship)', 5),
 ('Failure (parachute)', 2),
 ('No attempt', 14),
 ('No attempt ', 1),
 ('Success', 24),
 ('Success (drone ship)', 8),
 ('Success (ground pad)', 8)]